КАКерамика_моя_старая_база/src/AccumulationRegisters/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыпускПродукции</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АналитикаУчетаПродукции</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

КАКерамика_моя_старая_база/src/AccumulationRegisters/ВыпускПродукции/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		Или ОбменДанными.Загрузка
		ИЛИ ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Выпуск.Период,
	|	Выпуск.Регистратор,
	|	Выпуск.Организация,
	|	Выпуск.АналитикаУчетаНоменклатуры,
	|	Выпуск.Распоряжение,
	|	Выпуск.КодСтроки,
	|	Выпуск.Заказ,
	|	Выпуск.ВидЗапасов,
	|	Выпуск.Спецификация,
	|	Выпуск.Подразделение,
	|	Выпуск.СтатьяРасходов,
	|	Выпуск.АналитикаРасходов,
	|	Выпуск.АналитикаАктивовПассивов,
	|
	|	Выпуск.Количество,
	|
	|	Выпуск.АналитикаУчетаПродукции
	|ПОМЕСТИТЬ ВыпускПродукцииПередЗаписью
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции КАК Выпуск
	|ГДЕ
	|	Выпуск.Регистратор = &Регистратор
	|");
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		Или ОбменДанными.Загрузка
		ИЛИ ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ) КАК МЕСЯЦ,
	|	Таблица.Организация                  КАК Организация,
	|	Таблица.Регистратор                  КАК Документ,
	|	ЛОЖЬ                                 КАК ИзмененыДанныеДляПартионногоУчетаВерсии21
	|ПОМЕСТИТЬ ВыпускПродукцииЗаданияКРасчетуСебестоимости
	|ИЗ
	|	(ВЫБРАТЬ
	|		Выпуск.Период,
	|		Выпуск.Регистратор,
	|		Выпуск.Организация,
	|		Выпуск.АналитикаУчетаНоменклатуры,
	|		Выпуск.Распоряжение,
	|		Выпуск.КодСтроки,
	|		Выпуск.Заказ,
	|		Выпуск.ВидЗапасов,
	|		Выпуск.Спецификация,
	|		Выпуск.Подразделение,
	|		Выпуск.СтатьяРасходов,
	|		Выпуск.АналитикаРасходов,
	|		Выпуск.АналитикаАктивовПассивов,
	|
	|		Выпуск.Количество,
	|
	|		Выпуск.АналитикаУчетаПродукции
	|	ИЗ
	|		ВыпускПродукцииПередЗаписью КАК Выпуск
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Выпуск.Период,
	|		Выпуск.Регистратор,
	|		Выпуск.Организация,
	|		Выпуск.АналитикаУчетаНоменклатуры,
	|		Выпуск.Распоряжение,
	|		Выпуск.КодСтроки,
	|		Выпуск.Заказ,
	|		Выпуск.ВидЗапасов,
	|		Выпуск.Спецификация,
	|		Выпуск.Подразделение,
	|		Выпуск.СтатьяРасходов,
	|		Выпуск.АналитикаРасходов,
	|		Выпуск.АналитикаАктивовПассивов,
	|
	|		-Выпуск.Количество,
	|
	|		Выпуск.АналитикаУчетаПродукции
	|	ИЗ
	|		РегистрНакопления.ВыпускПродукции КАК Выпуск
	|	ГДЕ
	|		Выпуск.Регистратор = &Регистратор
	|	) КАК Таблица
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ),
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.АналитикаУчетаНоменклатуры,
	|	Таблица.Распоряжение,
	|	Таблица.КодСтроки,
	|	Таблица.Заказ,
	|	Таблица.ВидЗапасов,
	|	Таблица.Спецификация,
	|	Таблица.Подразделение,
	|	Таблица.СтатьяРасходов,
	|	Таблица.АналитикаРасходов,
	|	Таблица.АналитикаАктивовПассивов,
	|	Таблица.АналитикаУчетаПродукции
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.Количество) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыпускПродукцииПередЗаписью
	|");
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
